books/Scrum: a Breathtakingly Brief and Agile Introduction.html
---
layout: notes
---
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Product Owner</a></li>
<li><a href="#sec-2">2. Scrum master</a></li>
<li><a href="#sec-3">3. Stories</a></li>
<li><a href="#sec-4">4. Done</a></li>
<li><a href="#sec-5">5. Sprint Cycle</a></li>
<li><a href="#sec-6">6. Daily Stand-ups</a></li>
</ul>
</div>
</nav>

<p>
<i>Scrum: a Breathtakingly Brief and Agile Introduction</i>
— Chris Sims, Hillary Louise Johnson
</p>

<p>
One of the mantras of scrum is “inspect and adapt,” and scrum teams
are characterized by an intense focus on <b>continuous improvement—of
their process</b>, but also of the product.
</p>

<p>
Three roles:
</p>

<ol class="org-ol">
<li><b>product owner</b>
</li>
<li>Scrum master
</li>
<li>Team member
</li>
</ol>

<p>
One way that the product owner maximizes ROI (Return On Investment) is
by directing the team toward the most valuable work.
</p>

<p>
7 +/- 2
So, how many team members should a scrum team have? The common rule of
thumb is seven, plus or minus two. That is, from five to nine.
</p>

<p>
Why do we do development work in these short cycles? <b>To learn</b>.
Experience is the best teacher.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Product Owner</h2>
<div class="outline-text-2" id="text-1">
<p>
Product owner controls the order, sometimes called priority, of items
in the team’s backlog.
</p>

<p>
In scrum, no-one but the product owner is authorized to ask the team
to do work or to change the order of backlog items.
</p>

<p>
The product owner is responsible for recording the requirements, often
in the form of user stories (eg, “As a role, I want a
feature so that I can accomplish something”)
</p>

<p>
The Product Owner Role in a Nutshell: holds the vision for the product
represents the interests of the  business represents the customers
owns the product backlog orders (prioritizes) the items in the product
backlog creates acceptance criteria for the backlog items is available
to answer team members’ questions.
</p>

<p>
The list of user stories is ordered such that the most important
story, the one that the team should do next, is at the top of the
list. Right below it is the story that the team should do second, and
so on.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Scrum master</h2>
<div class="outline-text-2" id="text-2">
<p>
The scrum master is not—we repeat, not—the team’s boss.
</p>

<p>
The scrum master role in a Nutshell: scrum expert and advisor coach
impediment bulldozer facilitator
</p>

<p>
The Team Member Role in a Nutshell: responsible for completing user
stories to incrementally increase the value of the product
self-organizes to get all of the necessary work done creates and owns
the estimates owns the “ how to do the work” decisions avoids siloed
“not my job” thinking.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Stories</h2>
<div class="outline-text-2" id="text-3">
<p>
Each item, or story, in the product backlog should include the
following information: Which users the story will benefit (who it is
for) A brief description of the desired functionality (what needs to
be built) The reason that this story is valuable (why we should do it)
An estimate as to how much work the story requires to implement
Acceptance criteria that will help us know when it has been
implemented correctly.
</p>

<p>
A story is something a team delivers; a task is a bit of work that a
person does. Each story will normally require many tasks.
</p>

<p>
This confusion about what “done” means can cause plenty of confusion
and trouble, when the salesperson asks why the team is still working
on the same story that the programmer said was done two weeks ago!
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Done</h2>
<div class="outline-text-2" id="text-4">
<p>
In order to avoid confusion, good scrum teams <b>create their own
definition of the word “done”</b>
</p>

<p>
The team’s definition may include things like: code written, code
reviewed, unit tests passing, regression tests passing, documentation
written, product owner sign-off, and so on.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Sprint Cycle</h2>
<div class="outline-text-2" id="text-5">
<p>
The Sprint Cycle The sprint cycle consists of several meetings, often
called ceremonies: sprint planning daily scrum story time sprint
review retrospective.
</p>

<p>
The shorter the sprint cycle, the more frequently the team is
delivering value to the business.
</p>

<p>
The meeting lengths shown are an appropriate starting point for a team
doing one-week sprints.
</p>

<p>
We recommend <b>one to two hours of sprint planning per week</b> of
development.
</p>

<ol class="org-ol">
<li>Part One: “What will we do?”
</li>
</ol>

<p>
The product owner decides which stories will be considered, but the
team members doing the actual work are the ones who decide how much
work they can take on.
</p>

<ol class="org-ol">
<li>Part 2: “How will we do it?”
</li>
</ol>

<p>
<b>The output of the sprint planning meeting is the sprint backlog</b>, the
list of all the committed stories, with their associated tasks.
</p>

<p>
We recommend <b>one to two hours of retrospective time for each week</b> of
development. Unlike the traditional “post mortem,” the aim of a
retrospective is never to generate a long laundry list of things that
went well and things that went wrong, but to identify no more than one
or two strategic changes to make in the next sprint. It’s about
process improvement.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Daily Stand-ups</h2>
<div class="outline-text-2" id="text-6">
<p>
Each participant quickly shares:
</p>

<ol class="org-ol">
<li>What tasks I’ve completed since the last daily scrum.
</li>
<li>What tasks I expect to complete by the next daily scrum.
</li>
<li>What obstacles are slowing me down.
</li>
</ol>
</div>
</div>
